#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_key_pair.my_key: Refreshing state... [id=my_key]
data.aws_ami.fedora: Reading...
aws_vpc.exposed_vpc: Refreshing state... [id=vpc-02de6a1830a07886f]
data.aws_ami.fedora: Read complete after 0s [id=ami-032ef4b86635548ec]
aws_security_group.exposed_security_group: Refreshing state... [id=sg-0285792b457e884ac]
aws_internet_gateway.exposed_igw: Refreshing state... [id=igw-0b32c3071b257c0eb]
aws_subnet.exposed_subnet: Refreshing state... [id=subnet-0d2540fab36706db7]
aws_security_group_rule.ssh_ingress_access: Refreshing state... [id=sgrule-2291127699]
aws_security_group_rule.http_ingress_access: Refreshing state... [id=sgrule-1040549926]
aws_security_group_rule.https_ingress_access: Refreshing state... [id=sgrule-2258556097]
aws_security_group_rule.egress_access: Refreshing state... [id=sgrule-128033544]
aws_route_table.exposed_pub_igw: Refreshing state... [id=rtb-0ce1a7d04638ef371]
aws_route_table_association.exposed_rt_subnet_public: Refreshing state... [id=rtbassoc-050ff4f5fe759865c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ansible_host.exposed_instance will be created
  + resource "ansible_host" "exposed_instance" {
      + groups    = [
          + "webserver",
        ]
      + id        = (known after apply)
      + name      = (known after apply)
      + variables = {
          + "ansible_python_interpreter"   = "/usr/bin/python3"
          + "ansible_ssh_private_key_file" = "~/.ssh/id_rsa"
          + "ansible_user"                 = "fedora"
        }
    }

  # aws_instance.exposed_instance will be created
  + resource "aws_instance" "exposed_instance" {
      + ami                                  = "ami-032ef4b86635548ec"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "my_key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0d2540fab36706db7"
      + tags                                 = {
          + "Name"      = "Exposed-Node"
          + "Terraform" = "true"
        }
      + tags_all                             = {
          + "Name"      = "Exposed-Node"
          + "Terraform" = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "6a0b6dc5fc205d864e73ea762f4472136ccca575"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0285792b457e884ac",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 40
          + volume_type           = "gp3"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + public_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @r3dact3d, Action: `pull_request`*